title: Where Execution
id: a9b9ff07-24d0-4f21-9af6-035aa26fee98
status: experimental
description: Where.exe runs
references:
    - https://blog.tofile.dev
tags:
    - attack.execution
author: pathtofile
date: 2022/01/15
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\where.exe'
    condition: selection
falsepositives:
    - unknown
level: low
